package database;

import java.sql.*;

public class Database {
	final static String url = "jdbc:mysql://localhost:3306/";
	final static String databaseName = "student_part_time_system_database";
	final static String vars = "?serverTimezone=UTC&useUnicode=true&characterEncoding=utf-8";
	final static String userName = "root";
	final static String password = "root";
	private static Connection connection = null;
	private static Statement statement = null;

	public static Statement getStatement() {
		if(null == statement) {
			connection();
		}
		return statement;
	}

	//建立数据库连接
	private static void connection() {
		try {
			Class.forName("com.mysql.cj.jdbc.Driver");
		}
		catch(ClassNotFoundException e) {
			System.out.println("database.Database.connection ClassNotFoundException: " + e);
		}
		
		while(connection == null) {
			try {
				connection = DriverManager.getConnection(url + databaseName+vars,userName,password);
			}
			catch(SQLException e) {
				System.out.println("database.Database.connection SQLException: " + e);
			}
			
			if(connection == null) {
				createNewDatabase();
			}
		}
		
		try {
			statement = connection.createStatement();
		} catch (SQLException e) {
			System.out.println("database.Database.connection SQLException: " + e);
		}
	}

	//创建新的数据库 databaseName
	private static boolean createNewDatabase() {
		Connection conn = null;
		Statement stat = null;
		
		try {
			Class.forName("com.mysql.cj.jdbc.Driver");
		}
		catch(ClassNotFoundException e) {
			System.out.println("database.Database.createNewDatabase ClassNotFoundException: " + e);
			return false;
		}
		
		try {
			conn = DriverManager.getConnection(url + "sys",userName,password);
			stat = conn.createStatement();
			
			//创建数据库
			stat.execute("CREATE DATABASE IF NOT EXISTS "+databaseName+" DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci");
			
			//创建管理员信息表，添加默认管理员
			stat.execute("CREATE TABLE " + databaseName + ".administrator_information (\r\n" + 
					"  `AccountNumber` int NOT NULL AUTO_INCREMENT,\r\n" + 
					"  `Password` char(16) DEFAULT '12345678',\r\n" + 
					"  `AccountName` char(16) DEFAULT '管理员',\r\n" + 
					"  PRIMARY KEY (`AccountNumber`)\r\n" + 
					") AUTO_INCREMENT=84130001;");
			stat.execute("INSERT INTO " + databaseName + ".administrator_information (Password,AccountName) VALUES ('12345678','zhangyi');");
			
			//创建地区信息表，添加部分地区信息
			stat.execute("CREATE TABLE " + databaseName + ".region_information (\r\n" + 
					"  `AreaId` int NOT NULL AUTO_INCREMENT,\r\n" + 
					"  `AreaCode` varchar(6) NOT NULL,\r\n" + 
					"  `AreaName` varchar(20) NOT NULL,\r\n" + 
					"  `Level` tinyint DEFAULT '-1',\r\n" + 
					"  `CityCode` varchar(50) DEFAULT NULL,\r\n" + 
					"  `LongitudeAndLatitude` varchar(50) DEFAULT NULL,\r\n" + 
					"  `ParentId` int DEFAULT '-1',\r\n" + 
					"  PRIMARY KEY (`AreaId`)\r\n" + 
					");");
			stat.execute("INSERT INTO " + databaseName + ".region_information (AreaId,AreaCode,AreaName,Level,CityCode,LongitudeAndLatitude,ParentId) VALUES\r\n" + 
					"	(1505, '410000', '河南省', 1, '[]', '113.753394,34.765869', -1),  \r\n" + 
					"    (1506, '410100', '郑州市', 2, '0371', '113.625328,34.746611', 1505),  \r\n" + 
					"    (1507, '410102', '中原区', 3, '0371', '113.613337,34.748256', 1506),  \r\n" + 
					"    (1508, '410103', '二七区', 3, '0371', '113.640211,34.724114', 1506),  \r\n" + 
					"    (1509, '410104', '管城回族区', 3, '0371', '113.6775,34.75429', 1506),  \r\n" + 
					"    (1510, '410105', '金水区', 3, '0371', '113.660617,34.800004', 1506),  \r\n" + 
					"    (1511, '410106', '上街区', 3, '0371', '113.30893,34.802752', 1506),  \r\n" + 
					"    (1512, '410108', '惠济区', 3, '0371', '113.6169,34.867457', 1506),  \r\n" + 
					"    (1513, '410122', '中牟县', 3, '0371', '113.976253,34.718936', 1506),  \r\n" + 
					"    (1514, '410181', '巩义市', 3, '0371', '113.022406,34.7481', 1506),  \r\n" + 
					"    (1515, '410182', '荥阳市', 3, '0371', '113.38324,34.786948', 1506),  \r\n" + 
					"    (1516, '410183', '新密市', 3, '0371', '113.391087,34.539376', 1506),  \r\n" + 
					"    (1517, '410184', '新郑市', 3, '0371', '113.740662,34.395949', 1506),  \r\n" + 
					"    (1518, '410185', '登封市', 3, '0371', '113.050581,34.454443', 1506),  \r\n" + 
					"    (1519, '410200', '开封市', 2, '0378', '114.307677,34.797966', 1505),  \r\n" + 
					"    (1520, '410202', '龙亭区', 3, '0378', '114.356076,34.815565', 1519),  \r\n" + 
					"    (1521, '410203', '顺河回族区', 3, '0378', '114.364875,34.800458', 1519),  \r\n" + 
					"    (1522, '410204', '鼓楼区', 3, '0378', '114.348306,34.78856', 1519),  \r\n" + 
					"    (1523, '410205', '禹王台区', 3, '0378', '114.34817,34.777104', 1519),  \r\n" + 
					"    (1524, '410212', '祥符区', 3, '0378', '114.441285,34.756916', 1519),  \r\n" + 
					"    (1525, '410221', '杞县', 3, '0378', '114.783139,34.549174', 1519),  \r\n" + 
					"    (1526, '410222', '通许县', 3, '0378', '114.467467,34.480433', 1519),  \r\n" + 
					"    (1527, '410223', '尉氏县', 3, '0378', '114.193081,34.411494', 1519),  \r\n" + 
					"    (1528, '410225', '兰考县', 3, '0378', '114.821348,34.822211', 1519),  \r\n" + 
					"    (1529, '410300', '洛阳市', 2, '0379', '112.453926,34.620202', 1505),  \r\n" + 
					"    (1530, '410302', '老城区', 3, '0379', '112.469766,34.6842', 1529),  \r\n" + 
					"    (1531, '410303', '西工区', 3, '0379', '112.427914,34.660378', 1529),  \r\n" + 
					"    (1532, '410304', '瀍河回族区', 3, '0379', '112.500131,34.679773', 1529),  \r\n" + 
					"    (1533, '410305', '涧西区', 3, '0379', '112.395756,34.658033', 1529),  \r\n" + 
					"    (1534, '410306', '吉利区', 3, '0379', '112.589112,34.900467', 1529),  \r\n" + 
					"    (1535, '410311', '洛龙区', 3, '0379', '112.463833,34.619711', 1529),  \r\n" + 
					"    (1536, '410322', '孟津县', 3, '0379', '112.445354,34.825638', 1529),  \r\n" + 
					"    (1537, '410323', '新安县', 3, '0379', '112.13244,34.728284', 1529),  \r\n" + 
					"    (1538, '410324', '栾川县', 3, '0379', '111.615768,33.785698', 1529),  \r\n" + 
					"    (1539, '410325', '嵩县', 3, '0379', '112.085634,34.134516', 1529),  \r\n" + 
					"    (1540, '410326', '汝阳县', 3, '0379', '112.473139,34.153939', 1529),  \r\n" + 
					"    (1541, '410327', '宜阳县', 3, '0379', '112.179238,34.514644', 1529),  \r\n" + 
					"    (1542, '410328', '洛宁县', 3, '0379', '111.653111,34.389197', 1529),  \r\n" + 
					"    (1543, '410329', '伊川县', 3, '0379', '112.425676,34.421323', 1529),  \r\n" + 
					"    (1544, '410381', '偃师市', 3, '0379', '112.789534,34.72722', 1529),  \r\n" + 
					"    (1545, '410400', '平顶山市', 2, '0375', '113.192661,33.766169', 1505),  \r\n" + 
					"    (1546, '410402', '新华区', 3, '0375', '113.293977,33.737251', 1545),  \r\n" + 
					"    (1547, '410403', '卫东区', 3, '0375', '113.335192,33.734706', 1545),  \r\n" + 
					"    (1548, '410404', '石龙区', 3, '0375', '112.898818,33.898713', 1545),  \r\n" + 
					"    (1549, '410411', '湛河区', 3, '0375', '113.320873,33.725681', 1545),  \r\n" + 
					"    (1550, '410421', '宝丰县', 3, '0375', '113.054801,33.868434', 1545),  \r\n" + 
					"    (1551, '410422', '叶县', 3, '0375', '113.357239,33.626731', 1545),  \r\n" + 
					"    (1552, '410423', '鲁山县', 3, '0375', '112.908202,33.738293', 1545),  \r\n" + 
					"    (1553, '410425', '郏县', 3, '0375', '113.212609,33.971787', 1545),  \r\n" + 
					"    (1554, '410481', '舞钢市', 3, '0375', '113.516343,33.314033', 1545),  \r\n" + 
					"    (1555, '410482', '汝州市', 3, '0375', '112.844517,34.167029', 1545),  \r\n" + 
					"    (1556, '410500', '安阳市', 2, '0372', '114.392392,36.097577', 1505),  \r\n" + 
					"    (1557, '410502', '文峰区', 3, '0372', '114.357082,36.090468', 1556),  \r\n" + 
					"    (1558, '410503', '北关区', 3, '0372', '114.355742,36.10766', 1556),  \r\n" + 
					"    (1559, '410505', '殷都区', 3, '0372', '114.303553,36.10989', 1556),  \r\n" + 
					"    (1560, '410506', '龙安区', 3, '0372', '114.301331,36.076225', 1556),  \r\n" + 
					"    (1561, '410522', '安阳县', 3, '0372', '114.130207,36.130584', 1556),  \r\n" + 
					"    (1562, '410523', '汤阴县', 3, '0372', '114.357763,35.924514', 1556),  \r\n" + 
					"    (1563, '410526', '滑县', 3, '0372', '114.519311,35.575417', 1556),  \r\n" + 
					"    (1564, '410527', '内黄县', 3, '0372', '114.901452,35.971704', 1556),  \r\n" + 
					"    (1565, '410581', '林州市', 3, '0372', '113.820129,36.083046', 1556),  \r\n" + 
					"    (1566, '410600', '鹤壁市', 2, '0392', '114.297309,35.748325', 1505),  \r\n" + 
					"    (1567, '410602', '鹤山区', 3, '0392', '114.163258,35.954611', 1566),  \r\n" + 
					"    (1568, '410603', '山城区', 3, '0392', '114.184318,35.898033', 1566),  \r\n" + 
					"    (1569, '410611', '淇滨区', 3, '0392', '114.298789,35.741592', 1566),  \r\n" + 
					"    (1570, '410621', '浚县', 3, '0392', '114.55091,35.67636', 1566),  \r\n" + 
					"    (1571, '410622', '淇县', 3, '0392', '114.208828,35.622507', 1566),  \r\n" + 
					"    (1572, '410700', '新乡市', 2, '0373', '113.926763,35.303704', 1505),  \r\n" + 
					"    (1573, '410702', '红旗区', 3, '0373', '113.875245,35.30385', 1572),  \r\n" + 
					"    (1574, '410703', '卫滨区', 3, '0373', '113.865663,35.301992', 1572),  \r\n" + 
					"    (1575, '410704', '凤泉区', 3, '0373', '113.915184,35.383978', 1572),  \r\n" + 
					"    (1576, '410711', '牧野区', 3, '0373', '113.908772,35.315039', 1572),  \r\n" + 
					"    (1577, '410721', '新乡县', 3, '0373', '113.805205,35.190836', 1572),  \r\n" + 
					"    (1578, '410724', '获嘉县', 3, '0373', '113.657433,35.259808', 1572),  \r\n" + 
					"    (1579, '410725', '原阳县', 3, '0373', '113.940046,35.065587', 1572),  \r\n" + 
					"    (1580, '410726', '延津县', 3, '0373', '114.20509,35.141889', 1572),  \r\n" + 
					"    (1581, '410727', '封丘县', 3, '0373', '114.418882,35.041198', 1572),  \r\n" + 
					"    (1582, '410728', '长垣县', 3, '0373', '114.668936,35.201548', 1572),  \r\n" + 
					"    (1583, '410781', '卫辉市', 3, '0373', '114.064907,35.398494', 1572),  \r\n" + 
					"    (1584, '410782', '辉县市', 3, '0373', '113.805468,35.462312', 1572),  \r\n" + 
					"    (1585, '410800', '焦作市', 2, '0391', '113.241823,35.215893', 1505),  \r\n" + 
					"    (1586, '410802', '解放区', 3, '0391', '113.230816,35.240282', 1585),  \r\n" + 
					"    (1587, '410803', '中站区', 3, '0391', '113.182946,35.236819', 1585),  \r\n" + 
					"    (1588, '410804', '马村区', 3, '0391', '113.322332,35.256108', 1585),  \r\n" + 
					"    (1589, '410811', '山阳区', 3, '0391', '113.254881,35.214507', 1585),  \r\n" + 
					"    (1590, '410821', '修武县', 3, '0391', '113.447755,35.223514', 1585),  \r\n" + 
					"    (1591, '410822', '博爱县', 3, '0391', '113.064379,35.171045', 1585),  \r\n" + 
					"    (1592, '410823', '武陟县', 3, '0391', '113.401679,35.099378', 1585),  \r\n" + 
					"    (1593, '410825', '温县', 3, '0391', '113.08053,34.940189', 1585),  \r\n" + 
					"    (1594, '410882', '沁阳市', 3, '0391', '112.950716,35.087539', 1585),  \r\n" + 
					"    (1595, '410883', '孟州市', 3, '0391', '112.791401,34.907315', 1585),  \r\n" + 
					"    (1596, '410900', '濮阳市', 2, '0393', '115.029216,35.761829', 1505),  \r\n" + 
					"    (1597, '410902', '华龙区', 3, '0393', '115.074151,35.777346', 1596),  \r\n" + 
					"    (1598, '410922', '清丰县', 3, '0393', '115.104389,35.88518', 1596),  \r\n" + 
					"    (1599, '410923', '南乐县', 3, '0393', '115.204675,36.069476', 1596),  \r\n" + 
					"    (1600, '410926', '范县', 3, '0393', '115.504201,35.851906', 1596),  \r\n" + 
					"    (1601, '410927', '台前县', 3, '0393', '115.871906,35.96939', 1596),  \r\n" + 
					"    (1602, '410928', '濮阳县', 3, '0393', '115.029078,35.712193', 1596),  \r\n" + 
					"    (1603, '411000', '许昌市', 2, '0374', '113.852454,34.035771', 1505),  \r\n" + 
					"    (1604, '411002', '魏都区', 3, '0374', '113.822647,34.025341', 1603),  \r\n" + 
					"    (1605, '411003', '建安区', 3, '0374', '113.822983,34.12466', 1603),  \r\n" + 
					"    (1606, '411024', '鄢陵县', 3, '0374', '114.177399,34.102332', 1603),  \r\n" + 
					"    (1607, '411025', '襄城县', 3, '0374', '113.505874,33.851459', 1603),  \r\n" + 
					"    (1608, '411081', '禹州市', 3, '0374', '113.488478,34.140701', 1603),  \r\n" + 
					"    (1609, '411082', '长葛市', 3, '0374', '113.813714,34.19592', 1603),  \r\n" + 
					"    (1610, '411100', '漯河市', 2, '0395', '114.016536,33.580873', 1505),  \r\n" + 
					"    (1611, '411102', '源汇区', 3, '0395', '114.017948,33.565441', 1610),  \r\n" + 
					"    (1612, '411103', '郾城区', 3, '0395', '114.006943,33.587409', 1610),  \r\n" + 
					"    (1613, '411104', '召陵区', 3, '0395', '114.093902,33.586565', 1610),  \r\n" + 
					"    (1614, '411121', '舞阳县', 3, '0395', '113.609286,33.437876', 1610),  \r\n" + 
					"    (1615, '411122', '临颍县', 3, '0395', '113.931261,33.828042', 1610),  \r\n" + 
					"    (1616, '411200', '三门峡市', 2, '0398', '111.200367,34.772792', 1505),  \r\n" + 
					"    (1617, '411202', '湖滨区', 3, '0398', '111.188397,34.770886', 1616),  \r\n" + 
					"    (1618, '411203', '陕州区', 3, '0398', '111.103563,34.720547', 1616),  \r\n" + 
					"    (1619, '411221', '渑池县', 3, '0398', '111.761797,34.767951', 1616),  \r\n" + 
					"    (1620, '411224', '卢氏县', 3, '0398', '111.047858,34.054324', 1616),  \r\n" + 
					"    (1621, '411281', '义马市', 3, '0398', '111.87448,34.7474', 1616),  \r\n" + 
					"    (1622, '411282', '灵宝市', 3, '0398', '110.89422,34.516828', 1616),  \r\n" + 
					"    (1623, '411300', '南阳市', 2, '0377', '112.528308,32.990664', 1505),  \r\n" + 
					"    (1624, '411302', '宛城区', 3, '0377', '112.539558,33.003784', 1623),  \r\n" + 
					"    (1625, '411303', '卧龙区', 3, '0377', '112.528789,32.989877', 1623),  \r\n" + 
					"    (1626, '411321', '南召县', 3, '0377', '112.429133,33.489877', 1623),  \r\n" + 
					"    (1627, '411322', '方城县', 3, '0377', '113.012494,33.254391', 1623),  \r\n" + 
					"    (1628, '411323', '西峡县', 3, '0377', '111.47353,33.307294', 1623),  \r\n" + 
					"    (1629, '411324', '镇平县', 3, '0377', '112.234697,33.03411', 1623),  \r\n" + 
					"    (1630, '411325', '内乡县', 3, '0377', '111.849392,33.044864', 1623),  \r\n" + 
					"    (1631, '411326', '淅川县', 3, '0377', '111.490964,33.13782', 1623),  \r\n" + 
					"    (1632, '411327', '社旗县', 3, '0377', '112.948245,33.056109', 1623),  \r\n" + 
					"    (1633, '411328', '唐河县', 3, '0377', '112.807636,32.681335', 1623),  \r\n" + 
					"    (1634, '411329', '新野县', 3, '0377', '112.360026,32.520805', 1623),  \r\n" + 
					"    (1635, '411330', '桐柏县', 3, '0377', '113.428287,32.380073', 1623),  \r\n" + 
					"    (1636, '411381', '邓州市', 3, '0377', '112.087493,32.68758', 1623),  \r\n" + 
					"    (1637, '411400', '商丘市', 2, '0370', '115.656339,34.414961', 1505),  \r\n" + 
					"    (1638, '411402', '梁园区', 3, '0370', '115.613965,34.443893', 1637),  \r\n" + 
					"    (1639, '411403', '睢阳区', 3, '0370', '115.653301,34.388389', 1637),  \r\n" + 
					"    (1640, '411421', '民权县', 3, '0370', '115.173971,34.648191', 1637),  \r\n" + 
					"    (1641, '411422', '睢县', 3, '0370', '115.071879,34.445655', 1637),  \r\n" + 
					"    (1642, '411423', '宁陵县', 3, '0370', '115.313743,34.460399', 1637),  \r\n" + 
					"    (1643, '411424', '柘城县', 3, '0370', '115.305708,34.091082', 1637),  \r\n" + 
					"    (1644, '411425', '虞城县', 3, '0370', '115.828319,34.400835', 1637),  \r\n" + 
					"    (1645, '411426', '夏邑县', 3, '0370', '116.131447,34.237553', 1637),  \r\n" + 
					"    (1646, '411481', '永城市', 3, '0370', '116.4495,33.929291', 1637),  \r\n" + 
					"    (1647, '411500', '信阳市', 2, '0376', '114.091193,32.147679', 1505),  \r\n" + 
					"    (1648, '411502', '浉河区', 3, '0376', '114.058713,32.116803', 1647),  \r\n" + 
					"    (1649, '411503', '平桥区', 3, '0376', '114.125656,32.101031', 1647),  \r\n" + 
					"    (1650, '411521', '罗山县', 3, '0376', '114.512872,32.203883', 1647),  \r\n" + 
					"    (1651, '411522', '光山县', 3, '0376', '114.919152,32.010002', 1647),  \r\n" + 
					"    (1652, '411523', '新县', 3, '0376', '114.879239,31.643918', 1647),  \r\n" + 
					"    (1653, '411524', '商城县', 3, '0376', '115.406862,31.798377', 1647),  \r\n" + 
					"    (1654, '411525', '固始县', 3, '0376', '115.654481,32.168137', 1647),  \r\n" + 
					"    (1655, '411526', '潢川县', 3, '0376', '115.051908,32.131522', 1647),  \r\n" + 
					"    (1656, '411527', '淮滨县', 3, '0376', '115.419537,32.473258', 1647),  \r\n" + 
					"    (1657, '411528', '息县', 3, '0376', '114.740456,32.342792', 1647),  \r\n" + 
					"    (1658, '411600', '周口市', 2, '0394', '114.69695,33.626149', 1505),  \r\n" + 
					"    (1659, '411602', '川汇区', 3, '0394', '114.650628,33.647598', 1658),  \r\n" + 
					"    (1660, '411621', '扶沟县', 3, '0394', '114.394821,34.059968', 1658),  \r\n" + 
					"    (1661, '411622', '西华县', 3, '0394', '114.529756,33.767407', 1658),  \r\n" + 
					"    (1662, '411623', '商水县', 3, '0394', '114.611651,33.542138', 1658),  \r\n" + 
					"    (1663, '411624', '沈丘县', 3, '0394', '115.098583,33.409369', 1658),  \r\n" + 
					"    (1664, '411625', '郸城县', 3, '0394', '115.177188,33.644743', 1658),  \r\n" + 
					"    (1665, '411626', '淮阳县', 3, '0394', '114.886153,33.731561', 1658),  \r\n" + 
					"    (1666, '411627', '太康县', 3, '0394', '114.837888,34.064463', 1658),  \r\n" + 
					"    (1667, '411628', '鹿邑县', 3, '0394', '115.484454,33.86', 1658),  \r\n" + 
					"    (1668, '411681', '项城市', 3, '0394', '114.875333,33.465838', 1658),  \r\n" + 
					"    (1669, '411700', '驻马店市', 2, '0396', '114.022247,33.012885', 1505),  \r\n" + 
					"    (1670, '411702', '驿城区', 3, '0396', '113.993914,32.973054', 1669),  \r\n" + 
					"    (1671, '411721', '西平县', 3, '0396', '114.021538,33.387684', 1669),  \r\n" + 
					"    (1672, '411722', '上蔡县', 3, '0396', '114.264381,33.262439', 1669),  \r\n" + 
					"    (1673, '411723', '平舆县', 3, '0396', '114.619159,32.96271', 1669),  \r\n" + 
					"    (1674, '411724', '正阳县', 3, '0396', '114.392773,32.605697', 1669),  \r\n" + 
					"    (1675, '411725', '确山县', 3, '0396', '114.026429,32.802064', 1669),  \r\n" + 
					"    (1676, '411726', '泌阳县', 3, '0396', '113.327144,32.723975', 1669),  \r\n" + 
					"    (1677, '411727', '汝南县', 3, '0396', '114.362379,33.006729', 1669),  \r\n" + 
					"    (1678, '411728', '遂平县', 3, '0396', '114.013182,33.145649', 1669),  \r\n" + 
					"    (1679, '411729', '新蔡县', 3, '0396', '114.96547,32.744896', 1669),  \r\n" + 
					"    (1680, '419001', '济源市', 2, '1391', '112.602256,35.067199', 1505);");
			
			//创建职业分类表，添加部分职业
			stat.execute("CREATE TABLE " + databaseName + ".occupational_classification (\r\n" + 
					"  `OccupationId` int NOT NULL AUTO_INCREMENT,\r\n" + 
					"  `OccupationName` char(16) NOT NULL,\r\n" + 
					"  PRIMARY KEY (`OccupationId`)\r\n" + 
					") AUTO_INCREMENT=1000;");
			stat.execute("INSERT INTO " + databaseName + ".occupational_classification (OccupationName) VALUES\r\n" + 
					"	 ('其他'),\r\n" + 
					"    ('模特'),\r\n" + 
					"    ('社会调查'),\r\n" + 
					"    ('礼仪'),\r\n" + 
					"    ('家庭教师'),\r\n" + 
					"    ('导游'),\r\n" + 
					"    ('促销员'),\r\n" + 
					"    ('翻译'),\r\n" + 
					"    ('服务生'),\r\n" + 
					"    ('助理'),\r\n" + 
					"    ('新媒体运营'),\r\n" + 
					"    ('客服'),\r\n" + 
					"    ('打字员'),\r\n" + 
					"    ('保安'),\r\n" + 
					"    ('保洁员');");
			
			//创建学生信息表
			stat.execute("CREATE TABLE " + databaseName + ".student_information (\r\n" + 
					"  `AccountNumber` int NOT NULL AUTO_INCREMENT,\r\n" + 
					"  `Password` char(16) NOT NULL,\r\n" + 
					"  `Name` char(16) NOT NULL,\r\n" + 
					"  `Gender` tinyint(1) NOT NULL DEFAULT '1',\r\n" + 
					"  `BirthDate` date NOT NULL,\r\n" + 
					"  `EducationalQualification` enum('中专在读','高中在读','专科在读','本科在读','研究生在读') DEFAULT NULL,\r\n" + 
					"  `PhoneNumber` int DEFAULT NULL,\r\n" + 
					"  PRIMARY KEY (`AccountNumber`)\r\n" + 
					") AUTO_INCREMENT=10000001;");
			
			//创建雇主信息表
			stat.execute("CREATE TABLE " + databaseName + ".employer_information (\r\n" + 
					"  `AccountNumber` int NOT NULL AUTO_INCREMENT,\r\n" + 
					"  `Password` char(16) NOT NULL,\r\n" + 
					"  `Name` char(30) NOT NULL,\r\n" + 
					"  `AreaId` int DEFAULT NULL,\r\n" + 
					"  `PhoneNumber` int DEFAULT NULL,\r\n" + 
					"  PRIMARY KEY (`AccountNumber`),\r\n" + 
					"  KEY `AreaId` (`AreaId`),\r\n" + 
					"  FOREIGN KEY (`AreaId`) REFERENCES " + databaseName + ".region_information (`AreaId`)\r\n" + 
					") AUTO_INCREMENT=10000001;");
			
			//创建学生简历表
			stat.execute("CREATE TABLE " + databaseName + ".curriculum_vitaes (\r\n" + 
					"  `Id` int NOT NULL AUTO_INCREMENT,\r\n" + 
					"  `AccountNumber` int DEFAULT NULL,\r\n" + 
					"  `AreaId` int DEFAULT NULL,\r\n" + 
					"  `OccupationId` int DEFAULT NULL,\r\n" + 
					"  `PayTime` enum('小时','日','周','月') DEFAULT NULL,\r\n" + 
					"  `PayValue` char(11) DEFAULT NULL,\r\n" + 
					"  `Other` char(100) DEFAULT NULL,\r\n" + 
					"  `CreateTime` timestamp NULL DEFAULT CURRENT_TIMESTAMP,\r\n" + 
					"  PRIMARY KEY (`Id`),\r\n" + 
					"  KEY `AreaId` (`AreaId`),\r\n" + 
					"  KEY `AccountNumber` (`AccountNumber`),\r\n" + 
					"  KEY `OccupationId` (`OccupationId`),\r\n" + 
					"  FOREIGN KEY (`AreaId`) REFERENCES " + databaseName + ".region_information (`AreaId`),\r\n" + 
					"  FOREIGN KEY (`AccountNumber`) REFERENCES " + databaseName + ".student_information (`AccountNumber`),\r\n" + 
					"  FOREIGN KEY (`OccupationId`) REFERENCES " + databaseName + ".occupational_classification (`OccupationId`)\r\n" + 
					") AUTO_INCREMENT=100000001;");
			
			//创建招聘信息表
			stat.execute("CREATE TABLE " + databaseName + ".part_time_jobs (\r\n" + 
					"  `Id` int NOT NULL AUTO_INCREMENT,\r\n" + 
					"  `AccountNumber` int DEFAULT NULL,\r\n" + 
					"  `AreaId` int DEFAULT NULL,\r\n" + 
					"  `OccupationId` int DEFAULT NULL,\r\n" + 
					"  `PayTime` enum('小时','日','周','月') DEFAULT NULL,\r\n" + 
					"  `PayValue` char(11) DEFAULT NULL,\r\n" + 
					"  `Contact` char(5) DEFAULT NULL,\r\n" + 
					"  `ContactNumber` int DEFAULT NULL,\r\n" + 
					"  `Other` char(100) DEFAULT NULL,\r\n" + 
					"  `CreateTime` timestamp NULL DEFAULT CURRENT_TIMESTAMP,\r\n" + 
					"  PRIMARY KEY (`Id`),\r\n" + 
					"  KEY `AreaId` (`AreaId`),\r\n" + 
					"  KEY `AccountNumber` (`AccountNumber`),\r\n" + 
					"  KEY `OccupationId` (`OccupationId`),\r\n" + 
					"  FOREIGN KEY (`AreaId`) REFERENCES " + databaseName + ".region_information (`AreaId`),\r\n" + 
					"  FOREIGN KEY (`AccountNumber`) REFERENCES " + databaseName + ".employer_information (`AccountNumber`),\r\n" + 
					"  FOREIGN KEY (`OccupationId`) REFERENCES " + databaseName + ".occupational_classification (`OccupationId`)\r\n" + 
					") AUTO_INCREMENT=100000001;");
			stat.close();
		}
		catch(SQLException e) {
			System.out.println("database.Database.createNewDatabase SQLException: " + e);
			return false;
		}
		
		finally{
			try{
				if(conn != null) {
					conn.close();
				}
			}
			catch(SQLException e){
				System.out.println("database.Database.createNewDatabase SQLException: " + e);
			}
		}
		
		return true;
	}

	//销毁connection和statement
	public static void destroy() {
		try {
			statement.close();
			statement = null;
			connection.close();
			connection = null;
		}
		catch(SQLException e) {
			System.out.println("database.Database.destroy SQLException: " + e);
		}
	}
}

